In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.round(np.random.randn(3,5),2), ['X', 'Y', 'Z'], ['A', 'B', 'C', 'D', 'E'])

In [4]:
df

      A     B     C     D     E
X -0.07  0.26 -1.63  0.29 -0.38
Y  0.78  0.43  0.05 -0.19  0.53
Z  0.77 -1.66  0.87  1.13 -1.88

In [11]:
# df['A']
df.iloc[2]
# df.B

A    0.77
B   -1.66
C    0.87
D    1.13
E   -1.88
Name: Z, dtype: float64

In [43]:
df.iloc[0]
df.loc['X']

A   -1.25
B   -0.19
C    1.49
D   -1.02
E   -1.13
Name: X, dtype: float64

In [45]:
df[['A', 'B']]

      A     B
X -1.25 -0.19
Y -0.80  0.09
Z  0.27  0.83

In [46]:
df[['A', 'B']].loc[['X', 'Y']]

      A     B
X -1.25 -0.19
Y -0.80  0.09

In [47]:
df[df > 0.5]

    A     B     C   D   E
X NaN   NaN  1.49 NaN NaN
Y NaN   NaN   NaN NaN NaN
Z NaN  0.83  1.06 NaN NaN

In [33]:
df['C'] > 0.5

X    False
Y     True
Z    False
Name: C, dtype: bool

In [48]:
df[df['C'] > 0.5]

      A     B     C     D     E
X -1.25 -0.19  1.49 -1.02 -1.13
Z  0.27  0.83  1.06 -0.03 -0.28

In [49]:
df

      A     B     C     D     E
X -1.25 -0.19  1.49 -1.02 -1.13
Y -0.80  0.09  0.48 -0.81 -1.67
Z  0.27  0.83  1.06 -0.03 -0.28

In [55]:
df.columns = [1,2,3,4,5]
df.columns = ['A', 'B', 'C', 'D', 'E']

In [57]:
df

      A     B     C     D     E
X -1.25 -0.19  1.49 -1.02 -1.13
Y -0.80  0.09  0.48 -0.81 -1.67
Z  0.27  0.83  1.06 -0.03 -0.28

In [60]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [64]:
# df.fillna(df.mean())
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64